experiment/results/compare_high_RPS/with_istio_20260101_014515/wrk_logs/wrk_200rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 103.102ms, rate sampling interval: 541ms
  Thread calibration: mean lat.: 91.041ms, rate sampling interval: 528ms
  Thread calibration: mean lat.: 82.571ms, rate sampling interval: 499ms
  Thread calibration: mean lat.: 88.069ms, rate sampling interval: 530ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    98.49ms  133.26ms 527.36ms   83.62%
    Req/Sec    49.27      9.93    72.00     72.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.48ms
 75.000%  173.70ms
 90.000%  296.70ms
 99.000%  527.36ms
 99.900%  765.95ms
 99.990%  894.97ms
 99.999%  952.32ms
100.000%  952.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.429     0.000000            1         1.00
       5.711     0.100000         1592         1.11
       6.451     0.200000         3175         1.25
       7.595     0.300000         4766         1.43
      11.567     0.400000         6347         1.67
      13.479     0.500000         7935         2.00
      14.975     0.550000         8728         2.22
      25.647     0.600000         9519         2.50
     126.911     0.650000        10313         2.86
     148.351     0.700000        11106         3.33
     173.695     0.750000        11903         4.00
     188.287     0.775000        12299         4.44
     204.031     0.800000        12694         5.00
     221.951     0.825000        13090         5.71
     243.967     0.850000        13486         6.67
     268.031     0.875000        13882         8.00
     281.599     0.887500        14083         8.89
     296.703     0.900000        14280        10.00
     311.551     0.912500        14478        11.43
     327.935     0.925000        14678        13.33
     348.159     0.937500        14875        16.00
     358.911     0.943750        14973        17.78
     370.687     0.950000        15072        20.00
     385.279     0.956250        15173        22.86
     399.359     0.962500        15272        26.67
     413.439     0.968750        15371        32.00
     421.375     0.971875        15420        35.56
     432.895     0.975000        15469        40.00
     447.487     0.978125        15518        45.71
     461.055     0.981250        15568        53.33
     482.559     0.984375        15618        64.00
     495.103     0.985938        15645        71.11
     505.599     0.987500        15667        80.00
     522.239     0.989062        15693        91.43
     535.551     0.990625        15717       106.67
     560.639     0.992188        15742       128.00
     571.903     0.992969        15754       142.22
     579.583     0.993750        15766       160.00
     591.871     0.994531        15779       182.86
     607.231     0.995313        15791       213.33
     625.663     0.996094        15804       256.00
     635.903     0.996484        15810       284.44
     645.631     0.996875        15816       320.00
     665.087     0.997266        15822       365.71
     684.543     0.997656        15828       426.67
     701.951     0.998047        15835       512.00
     709.631     0.998242        15838       568.89
     730.623     0.998437        15841       640.00
     734.719     0.998633        15844       731.43
     749.055     0.998828        15847       853.33
     766.463     0.999023        15852      1024.00
     766.463     0.999121        15852      1137.78
     769.023     0.999219        15853      1280.00
     775.167     0.999316        15855      1462.86
     795.135     0.999414        15856      1706.67
     820.223     0.999512        15858      2048.00
     827.903     0.999561        15859      2275.56
     827.903     0.999609        15859      2560.00
     867.839     0.999658        15860      2925.71
     871.935     0.999707        15861      3413.33
     874.495     0.999756        15862      4096.00
     874.495     0.999780        15862      4551.11
     874.495     0.999805        15862      5120.00
     894.975     0.999829        15863      5851.43
     894.975     0.999854        15863      6826.67
     899.071     0.999878        15864      8192.00
     899.071     0.999890        15864      9102.22
     899.071     0.999902        15864     10240.00
     899.071     0.999915        15864     11702.86
     899.071     0.999927        15864     13653.33
     952.319     0.999939        15865     16384.00
     952.319     1.000000        15865          inf
#[Mean    =       98.495, StdDeviation   =      133.260]
#[Max     =      951.808, Total count    =        15865]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17770 requests in 1.50m, 21.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 76
Requests/sec:    197.38  
Transfer/sec:    246.42KB