experiment/results/compare_high_RPS/with_istio_20260101_014515/wrk_logs/wrk_400rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 253.921ms, rate sampling interval: 1256ms
  Thread calibration: mean lat.: 272.385ms, rate sampling interval: 1400ms
  Thread calibration: mean lat.: 249.049ms, rate sampling interval: 1325ms
  Thread calibration: mean lat.: 241.293ms, rate sampling interval: 1208ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   433.32ms  531.58ms   2.47s    87.52%
    Req/Sec    99.22     10.33   123.00     75.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  281.86ms
 75.000%  626.69ms
 90.000%    1.08s 
 99.000%    2.47s 
 99.900%    4.30s 
 99.990%    5.17s 
 99.999%    5.38s 
100.000%    5.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.189     0.000000            1         1.00
       8.487     0.100000         3190         1.11
      19.439     0.200000         6378         1.25
      43.007     0.300000         9560         1.43
     175.359     0.400000        12744         1.67
     281.855     0.500000        15934         2.00
     334.847     0.550000        17522         2.22
     394.495     0.600000        19116         2.50
     459.007     0.650000        20707         2.86
     537.599     0.700000        22304         3.33
     626.687     0.750000        23899         4.00
     679.935     0.775000        24693         4.44
     738.815     0.800000        25487         5.00
     802.303     0.825000        26284         5.71
     878.591     0.850000        27080         6.67
     965.119     0.875000        27880         8.00
    1018.879     0.887500        28273         8.89
    1077.247     0.900000        28671        10.00
    1142.783     0.912500        29069        11.43
    1213.439     0.925000        29466        13.33
    1303.551     0.937500        29867        16.00
    1353.727     0.943750        30066        17.78
    1418.239     0.950000        30263        20.00
    1492.991     0.956250        30462        22.86
    1584.127     0.962500        30663        26.67
    1686.527     0.968750        30860        32.00
    1753.087     0.971875        30962        35.56
    1820.671     0.975000        31060        40.00
    1904.639     0.978125        31159        45.71
    2006.015     0.981250        31258        53.33
    2131.967     0.984375        31358        64.00
    2213.887     0.985938        31409        71.11
    2279.423     0.987500        31458        80.00
    2392.063     0.989062        31508        91.43
    2533.375     0.990625        31557       106.67
    2686.975     0.992188        31607       128.00
    2781.183     0.992969        31632       142.22
    2861.055     0.993750        31656       160.00
    2932.735     0.994531        31681       182.86
    3018.751     0.995313        31706       213.33
    3153.919     0.996094        31731       256.00
    3205.119     0.996484        31744       284.44
    3287.039     0.996875        31756       320.00
    3350.527     0.997266        31768       365.71
    3479.551     0.997656        31781       426.67
    3553.279     0.998047        31795       512.00
    3678.207     0.998242        31800       568.89
    3766.271     0.998437        31806       640.00
    3960.831     0.998633        31812       731.43
    4122.623     0.998828        31818       853.33
    4337.663     0.999023        31824      1024.00
    4407.295     0.999121        31828      1137.78
    4456.447     0.999219        31831      1280.00
    4595.711     0.999316        31834      1462.86
    4689.919     0.999414        31837      1706.67
    4820.991     0.999512        31841      2048.00
    4841.471     0.999561        31842      2275.56
    4874.239     0.999609        31843      2560.00
    4886.527     0.999658        31845      2925.71
    4984.831     0.999707        31846      3413.33
    5021.695     0.999756        31848      4096.00
    5054.463     0.999780        31849      4551.11
    5054.463     0.999805        31849      5120.00
    5062.655     0.999829        31850      5851.43
    5091.327     0.999854        31851      6826.67
    5165.055     0.999878        31852      8192.00
    5165.055     0.999890        31852      9102.22
    5165.055     0.999902        31852     10240.00
    5189.631     0.999915        31853     11702.86
    5189.631     0.999927        31853     13653.33
    5197.823     0.999939        31854     16384.00
    5197.823     0.999945        31854     18204.44
    5197.823     0.999951        31854     20480.00
    5197.823     0.999957        31854     23405.71
    5197.823     0.999963        31854     27306.67
    5378.047     0.999969        31855     32768.00
    5378.047     1.000000        31855          inf
#[Mean    =      433.317, StdDeviation   =      531.577]
#[Max     =     5373.952, Total count    =        31855]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35695 requests in 1.50m, 33.84MB read
  Non-2xx or 3xx responses: 5
Requests/sec:    396.59  
Transfer/sec:    384.96KB